//////////////////////////////////////////////////////////////
// ÃÂÃÂÃÂÃÂÃÂÃÂÃÂÃÂ¯ ÃÂÃÂ¡ÃÂÃÂÃÂÃÂÃÂÃÂÃÂ¡ÃÂ¢ÃÂÃÂ
//////////////////////////////////////////////////////////////

cpi_peasant_feat=Team Spirit.
cpi_priest_feat=Holy Attack, Holiness, No melee Penalty, Regenerates Mana.
cpi_robber_feat=Robber.
cpi_archmage_feat=Lightning, Magic Protection, Immune to Mind spells, Regenerates Mana.
cpi_footman_feat=Armor.
cpi_footman2_feat=Armor, Commander.
cpi_bowman_feat=Archer.
cpi_griffin_feat=Flight, Furious, Magic Resistance.
cpi_horseman_feat=Armor, Horseman, Fire Resistance.
cpi_knight_feat=Steel Armor, Valor, Dragon Slayer.

cpi_werewolf_feat=Blades, Night Sight, Regeneration, Tolerance, Leader of the Pack, Loves the Forest.
cpi_wolf_feat=Night Sight, Frenzy, Regeneration, Tolerance, Leader of the Pack, Loves the Forest.
cpi_druid_feat=Power of Forest, Magic Resistance, Harmony Aura, Loves the Forest, Dislikes Dungeons, Regenerates Mana.
cpi_dryad_feat=Soaring, No retaliation, Beauty, Charm, Tree Fairy, Loves the Forest, Dislikes Dungeons.
cpi_elf_feat=Archer, Sniper, No Melee Penalty, Loves the Forest, Dislikes Dungeons.
cpi_elf2_feat=Archer, Sniper, No Melee Penalty, Hunter, Loves the Forest, Dislikes Dungeons.
cpi_ent_feat=Plant, Wooden, Spirit of the Forest, Entangle, Loves the Forest, Dislikes Dungeons.
cpi_unicorn_feat=Magic Resistance, Horn of Light, Defender of Beauty, Magical Aura, Loves the Forest, Dislikes Dungeons.
cpi_unicorn2_feat=Magic Resistance, Horn of Light, Tolerance, Magical Curse, Loves the Forest.
cpi_sprite_feat=Soaring, No retaliation, Magic Resistance, Vulnerable to Fire, Cutie, Loves the Forest, Dislikes Dungeons.
cpi_sprite2_feat=Soaring, No retaliation, Magic Resistance, Fairy Dust, Cutie, Loves the Forest, Dislikes Dungeons.

cpi_dwarf_feat=Likes Dungeons, Sea Sick.
cpi_alchemist_feat=Poison Resistance, Acid Spray, No Melee Penalty, Likes Dungeons, Sea Sick.
cpi_cannoner_feat=Archer, Siege Gun, No Melee Penalty, Likes Dungeons.
cpi_giant_feat=Resistant to Cold, Likes Emerald Green Dragons, Thump.
cpi_miner_feat=Night Sight, Sea Sick.

cpi_goblin_feat=Archer, No Melee Penalty.
cpi_goblin2_feat=Furious.
cpi_catapult_feat=Archer, Siege Gun, Vulnerable to Fire.
cpi_hyena_feat=Night Sight, Scavenger.
cpi_ogre_feat=Orc's Commander, Clobber.
cpi_orc_feat=Ill-Tempered.
cpi_orc2_feat=Counterattack, Ill-Tempered.
cpi_shaman_feat=Regenerates Mana.

cpi_vampire_feat=Undead, Regeneration, No retaliation.
cpi_vampire2_feat=Undead, Regeneration, No retaliation, Death's Deception.
cpi_bat_feat=Undead, Soaring, No retaliation, Drain Life.
cpi_zombie_feat=Undead.
cpi_zombie2_feat=Undead, Decay.
cpi_archer_feat=Undead, Archer, Bone.
cpi_skeleton_feat=Undead, Bone.
cpi_bonedragon_feat=Undead, Bone, Flight, Chaos, Dread.
cpi_ghost_feat=Undead, Soaring, Phantom, Soul Draining.
cpi_ghost2_feat=Undead, Soaring, Phantom, Soul Draining.
cpi_blackknight_feat=Undead, Steel Armor, Dark Commander, Rising Anger.
cpi_necromant_feat=Undead, Cloud of Darkness, Regenerates Mana.
cpi_spider_undead_feat=Cursed, Undead.

cpi_imp_feat=Demon, Strike and Return, No retaliation.
cpi_imp2_feat=Demon, Strike and Return, No retaliation.
cpi_demon_feat=Demon, Furious, Domination.
cpi_cerberus_feat=Demon, Three-headed.
cpi_archdemon_feat=Demon, Teleportation, Immune to Fire, Restoration, No retaliation, Odium.
cpi_demoness_feat=Demon, Beauty.
cpi_spider_fire_feat=Underground, Demon, Poison Resistance, Immune to Mind spells.

cpi_barbarian_feat=Resistant to Cold, Immune to Mind spells, Primal Link.
cpi_berserk_feat=Berserk, Resistant to Cold, Immune to Mind spells, Primal Link.
cpi_pirat_feat=Gold Hunter, Marine.
cpi_graywolf_feat=Night Sight, Frenzy, Likes the Forest.
cpi_bear_feat=Critical Attack, Brutality, Hibernation, Noble Beast, Maul, Likes the Forest.
cpi_bear_white_feat=Critical Attack, Brutality, Hibernation, Resistant to Cold, Noble Beast, Maul.
cpi_thorn_feat=Archer, Plant, Eyeless, No Melee Penalty, Tasty Soil.
cpi_thorn2_feat=Plant, Eyeless, Tasty Soil.
cpi_kingthorn_feat=Archer, Plant, Eyeless, Thorn Monarch, Tasty Soil.
cpi_dragonfly_feat=Soaring, Magic Resistance, Weakness.
cpi_dragonfly_red_feat=Soaring, Fire Resistance.
cpi_snake_green_feat=Venomous, Immune to Poison.
cpi_snake_royal_feat=No retaliation, Venomous, Immune to Poison.
cpi_snake_feat=Poison Protection.
cpi_spider_feat=Underground, Stone Skin.
cpi_spider_venom_feat=Underground, Venomous, Immune to Poison.
cpi_cyclop_feat=Archer, Sniper, Stone, No Melee Penalty, Bash, Throws Stones.
cpi_greendragon_feat=Flight, Hates Giants, Magic Resistance, Fire Protection, Immune to Mind spells.
cpi_phoenix_feat=Flight, Firestorm, Immune to Fire, Magic Immunity, Immune to Mind spells, Rebirth.
cpi_blackdragon_feat=Flight, Dragon Breath, Immune to Fire, Magic Immunity, Immune to Mind spells, Dragon Power.
// New! Blue Dragons!
cpi_bluedragon_feat=Flight, Blue Dragon Breath, Immune to Fire, Immune to Mind spells, Magic Immunity, Discharge, Dragonfly Commander, Dragon Aversion.
cpi_beholder_feat=Soaring, Archer, Paralyzing Ray, Underground, Immune to Mind spells, Regenerates Mana.
cpi_reddragon_feat=Flight, Dragon Breath, Magic Resistance, Immune to Fire, Immune to Mind spells.
cpi_devilfish_feat=Marine, Fire Resistance, Night Sight, Terrible, Critical Attack.

cpi_book1_feat=Common Spells, Immune to Poison, Magic Immunity, Immune to Mind spells, Vulnerable to Fire, Regenerates Mana.
cpi_book2_feat=Strong Spells, Immune to Poison, Magic Immunity, Immune to Mind spells, Vulnerable to Fire, Regenerates Mana.
cpi_book3_feat=Powerful Spells, Immune to Poison, Magic Immunity, Immune to Mind spells, Vulnerable to Fire, Regenerates Mana.

cpi_orb_feat=Ice, Ball, Knockback, Magic Immunity, Immune to Mind Spells.

//////////////////////////////////////////////////////////////
// ÃÂÃÂÃÂÃÂ¡ÃÂÃÂÃÂÃÂ ÃÂÃÂ¡ÃÂÃÂÃÂÃÂÃÂÃÂÃÂ¡ÃÂ¢ÃÂÃÂ
//////////////////////////////////////////////////////////////

// ÃÂ§ÃÂÃÂÃÂÃÂÃÂÃÂÃÂ
comradeship_header=^def_hint_t0^Team Spirit
comradeship_hint=^def_hint_t1^Attack is increased by the square root of the total number of troops. There is no restriction on how high this bonus can go.

robbery_header=^def_hint_t0^Robber
robbery_hint=^def_hint_t1^Morale of human troops level 1-2 is decreased by 1.

armor_header=^def_hint_t0^Armor
armor_hint=^def_hint_t1^Good Physical Damage Resistance

holy_attack_header=^def_hint_t0^Holy Attack
holy_attack_hint=^def_hint_t1^Attack (both Melee and Ranged) inflicts double Magic Damage to the undead and has a chance (double if Attack is Melee) to decrease their combat ability.

holy_aura_header=^def_hint_t0^Holiness
holy_aura_hint=^def_hint_t1^Takes no penalties for the presence of the undead in the army.

no_melee_header=^def_hint_t0^No Melee Penalty
no_melee_hint=^def_hint_t1^The creature inflicts the same damage during Melee and Ranged Attacks.

magic_protection_header=^def_hint_t0^Magic Protection
magic_protection_hint=^def_hint_t1^Gives the creature +50% Magic Resistance.

tireless_header=^def_hint_t0^Furious
tireless_hint=^def_hint_t1^Always retaliates against enemy attacks.

cavalry_header=^def_hint_t0^Horseman
cavalry_hint=^def_hint_t1^When moving in a straight line, horseman increases the damage by 10% for each cell.

steel_armor_header=^def_hint_t0^Steel Armor
steel_armor_hint=^def_hint_t1^High Physical Damage Resistance

commander_header=^def_hint_t0^Commander
commander_hint=^def_hint_t1^Increases the Morale of Bowmen and Swordsmen by 1.

valorous_header=^def_hint_t0^Valor
valorous_hint=^def_hint_t1^Self-esteem gives the creature +1 Morale.

dragon_slayer_header=^def_hint_t0^Dragon Slayer
dragon_slayer_hint=^def_hint_t1^Increased Attack against Dragons and Fire Resistant.

//ÃÂÃÂÃÂ¬ÃÂ¤ÃÂ«

regeneration_header=^def_hint_t0^Regeneration
regeneration_hint=^def_hint_t1^Recovers maximum points of health each turn.

druid_shot_header=^def_hint_t0^Power of the Forest
druid_shot_hint=^def_hint_t1^Does a Ranged Attack, inflicting Magic Damage to the target and the surrounding enemy troops.

beauty_header=^def_hint_t0^Beauty
beauty_hint=^def_hint_t1^Being confused by a beautiful girl, male humanoids can miss with a probability of 30%.

cute_header=^def_hint_t0^Cutie
cute_hint=^def_hint_t1^Being disarmed by the girl's infectious cuteness (a "cutie"), male humanoids can miss with a probability of 20%.

charm_header=^def_hint_t0^Charm
charm_hint=^def_hint_t1^During attack, the creature can fascinate a male humanoid with a probability of 20%, turning him to fight on the Dryad's side.

wood_fairy_header=^def_hint_t0^Tree Fairy
wood_fairy_hint=^def_hint_t1^Ents and Thorns in the army gain +1 Morale.

sniper_header=^def_hint_t0^Sniper
sniper_hint=^def_hint_t1^No penalty for Ranged attack.

beast_killer_header=^def_hint_t0^Hunter
beast_killer_hint=^def_hint_t1^Inflicts 150% damage against beasts.

double_shot_header=^def_hint_t0^Double Arrows
double_shot_hint=^def_hint_t1^Always discharges 2 arrows.

wood_header=^def_hint_t0^Wooden
wood_hint=^def_hint_t1^Resistant to Physical Damage. Suffers only 40% of physically resisted damage from arrows. Not as vulnerable to Fire as plants (125% to 150% Damage). Immune to Mind spells.

entangle_header=^def_hint_t0^Entangle
entangle_hint=^def_hint_t1^When attacking, the creature has a 50% chance to "entangle" a non-plant, non-floating level 1-4 enemy troop. Entangled troops cannot move and have reduced initiative (half) for 3 turns.

entangle2_header=^def_hint_t0^Greater Entangle
entangle2_hint=^def_hint_t1^When attacking, the creature has a 75% chance to "entangle" a non-plant, non-floating level 1-5 enemy troop. Entangled troops cannot move and have reduced initiative (half) for 3 turns.

magic_resistance_header=^def_hint_t0^Magic Resistance
magic_resistance_hint=^def_hint_t1^Gives the creature Magic Resistance ability.

blade_header=^def_hint_t0^Blades
blade_hint=^def_hint_t1^Serrated blades inflict severe wounds, decreasing the target's fighting ability.

fire_resistance_header=^def_hint_t0^Fire Resistance
fire_resistance_hint=^def_hint_t1^Gives the creature Fire Resistance.

harmony_header=^def_hint_t0^Harmony Aura
harmony_hint=^def_hint_t1^All Elves in the army gain +1 Morale.

light_horn_header=^def_hint_t0^Horn of Light
light_horn_hint=^def_hint_t1^Has a 15% chance (20% for <label=cpsn_unicorn2>) to physically blind the target for 3 rounds. The chance is doubled if the attack is against <label=cpsn_beholder>, <label=cpsn_beholder2>, <label=cpsn_cyclop>, demons, or the undead and duration is +1. The chance is double again (for all units) if the combat takes place in the evening or at night or underground and +1 is added to the duration as well. Blinded creatures have a 50% chance of becoming scared. Also Inflicts an additional 30% Magic Damage to demons and the undead. Note that the chance to blind the target does not work on other <label=cpsn_unicorn> or <label=cpsn_unicorn2>.

magic_aura_header=^def_hint_t0^Magical Aura
magic_aura_hint=^def_hint_t1^Provides +20% magic resistance to all allied units (does not affect allied <label=cpsn_unicorn> and <label=cpsn_unicorn2>).

magic_curse_header=^def_hint_t0^Magical Curse
magic_curse_hint=^def_hint_t1^Enemy magic resistance -30% (does not affect enemy <label=cpsn_unicorn> and <label=cpsn_unicorn2>).

defender_beauty_header=^def_hint_t0^Defender of Beauty
defender_beauty_hint=^def_hint_t1^Sprites and Dryads gain +2 Morale.

fire_weakness_header=^def_hint_t0^Vulnerable to Fire
fire_weakness_hint=^def_hint_t1^Fire inflicts 150% damage.

faery_dust_header=^def_hint_t0^Fairy Dust
faery_dust_hint=^def_hint_t1^Can cast "Weakness" on the target during the attack.

// ÃÂÃÂÃÂÃÂÃÂ«
acid_sprays_header=^def_hint_t0^Acid Spray
acid_sprays_hint=^def_hint_t1^It discharges an Acid Spray within the area of 3 cells, which burns all in its reach. An enemy has no ability to retaliate. The alchemist receives some of the bonuses which apply to archers.

hates_green_header=^def_hint_t0^Likes Emerald Green Dragons
hates_green_hint=^def_hint_t1^Considers Emerald Green Dragons to be very delicious and nutritious food. Morale of Giants is increased.

// New! Giant Thump
giant_attack_header=^def_hint_t0^Thump
giant_attack_hint=^def_hint_t1^During its attack, the giant attempts to strike the head of the target with its huge club. If successful, the target will be knocked unconscious for 1 round. Upon waking, the target will be stunned for an additional 2 rounds. Chance of the attack being successful is 50% or 75% (1.5x) if the target is already stunned. The target's physical resistance affects the chance of the attack being successful as well as the duration and Golems, Plants, the Undead, and Mind Immune Creatures cannot be knocked unconscious.

noble_beast_header=^def_hint_t0^Noble Beast
noble_beast_hint=^def_hint_t1^The Bears' nobility and ferocity inspire Barbarians. Barbarian Morale increased +2.

primal_link_header=^def_hint_t0^Primal Link
primal_link_hint=^def_hint_t1^The Barbarians' primal instincts encourages beasts (bears, wolves, and hyenas) to fight more ferociously. Beast Morale increased +2.

thorn_commander_header=^def_hint_t0^Thorn Monarch
thorn_commander_hint=^def_hint_t1^The presence of the Royal Thorn increases the Morale of all thorns +3.

forest_spirit_header=^def_hint_t0^Spirit of the Forest
forest_spirit_hint=^def_hint_t1^The Ents' mystical spirit strengthens any Royal Thorns in the Army. Royal Thorn Morale +2.

pack_leader_header=^def_hint_t0^Leader of the Pack
pack_leader_hint=^def_hint_t1^The presence of the Werewolf Elf increases the Morale of wolves +1.

poison_resistance_header=^def_hint_t0^Poison Resistance
poison_resistance_hint=^def_hint_t1^Gives the creature +25% Resistance to Poison Damage.

siege_weapon_header=^def_hint_t0^Siege Gun
siege_weapon_hint=^def_hint_t1^Inflicts 200% of damage to obstacles, barriers, and gremlin towers and has no penalty for ranged attack.

siege_weapon_header2=^def_hint_t0^Siege Gun
siege_weapon_hint2=^def_hint_t1^Inflicts 200% of damage to obstacles, barriers, and gremlin towers and has no penalty for ranged attack and inflicts 50% damage to the surrounding area.

// ÃÂÃÂ ÃÂÃÂ 
double_attack_header=^def_hint_t0^Counterattack
double_attack_hint=^def_hint_t1^If the enemy retaliates, the orc attacks one more time. Does not work against enemies with meek attack.

// New! (Veteran) Orc Ill-Tempered
get_angry_header=^def_hint_t0^Ill-Tempered
get_angry_hint=^def_hint_t1^The troop gets angry 50% of the time when struck by a critical blow and it can't retaliate. If it has moved already, it may move again, otherwise it receives 50% to its action points for the remainder of the round and +1 to its initiative for the remainder of the combat!

orks_commander_header=^def_hint_t0^Orc Commander
orks_commander_hint=^def_hint_t1^Orcs and Goblins gain +3 Attack.

// New! Ogre Clobber
ogre_attack_header=^def_hint_t0^Clobber
ogre_attack_hint=^def_hint_t1^The Ogre attacks with such force that it has a chance to stun the opponent. If the stun is successful or the defender is already stunned it also has a chance of knocking the creature unconscious. The base stun chance is 95% for level 1 and -15% for each higher level (i.e. 35% for level 5); the base sleep chance is 15% per level under the Ogre's (i.e. 15% for Level 5, 75% for Level 1) and +10% if the unit is already stunned. The unconscious duration is 1 round (+1 if unit is already stunned). The stunning lasts for 2 rounds or for 2 rounds after the troop wakes up if it is knocked unconscious. Plants and Golems cannot be stunned and,  including the Undead and Mind Immune creatures, cannot be knocked unconscious. The defender's physical resistance affects the chance of both effects as well as the duration.


// ÃÂÃÂÃÂÃÂÃÂ¢ÃÂ¬
// New! Bone Dragon's Chaos
bonedragon_attack_header=^def_hint_t0^Chaos
bonedragon_attack_hint=^def_hint_t1^Casts a random Chaos Spell or Effect (Fear, Plague, Weakness, Doom, Sheep, or Curse) on the target (if applicable) when attacking. Chance to cast the spell is +20% for each level the unit is below the Bone Dragon's (i.e. level 1 = 80%, level 4 = 20%). The power of the spell is affected by the hero's spell power if the troop is lead by one and the spell is cast at third level.

// New! Bone Dragon's Dread
dread_header=^def_hint_t0^Dread
dread_hint=^def_hint_t1^The Bone Dragon strikes dread into the hearts of its enemies lowering their Morale. Units of level 1-2 lose 3 morale, level 3-4 lose 2 morale, and level 5 units lose 1 morale. Does not affect the Undead, Plants, Golems, Holy, and Mind Immune creatures.

dead_evasion_header=^def_hint_t0^Death's Deception
dead_evasion_hint=^def_hint_t1^Avoids critical attacks 50% of the time by vanishing in the shadows.

undead_header=^def_hint_t0^Undead
undead_hint=^def_hint_t1^Being raised from the dead has the following features:<br>50% Poison Protection<br>+50% Attack during nighttime and underground combat.<br>+50% Defense if combat takes place in the cemetery.<br>-25% Health if combat takes place in the day (excludes cemeteries, dungeons, and lava).<br>Takes 200% of damage from Holy Attacks.<br>Immune to Mind spells and some other spells.

vampirism_header=^def_hint_t0^Drain Life
vampirism_hint=^def_hint_t1^Sucks a part of the health points from its enemy, recovering his own health. Dead creatures arise. Note that this capability is half as effective if combat takes place in the morning or afternoon (as long as not in a cemetary or underground).

rotting_header=^def_hint_t0^Decay
rotting_hint=^def_hint_t1^When dying, it discharges the rot of death, which infects the surrounding troops with the plague.

bone_header=^def_hint_t0^Bone
bone_hint=^def_hint_t1^Suffers only 30% of damage from arrows.

phantom_header=^def_hint_t0^Phantom
phantom_hint=^def_hint_t1^Immune to Physical and Poison Damage (20% Damage), Vulnerable to Magic (200% Damage), and can pass through barriers.<br>Suffer -50% health in daylight (excludes cemeteries, dungeons, and lava).

soul_drain_header=^def_hint_t0^Soul Draining
soul_drain_hint=^def_hint_t1^Drains the souls of enemy troops, recovering his own health and turning them into ghosts. Does not affect the Undead, Demons, Plants, Golems, or Holy troops. Note that this capability is half as effective if combat takes place in the morning or afternoon (as long as not in a cemetary or underground).

dark_commander_header=^def_hint_t0^Dark Commander
dark_commander_hint=^def_hint_t1^Undead creatures in the army gain +1 Morale.

increasing_anger_header=^def_hint_t0^Rising Anger
increasing_anger_hint=^def_hint_t1^Each time the enemy is attacked, unit receives a bonus +3 to Damage and +3% chance of a Critical Attack, up to a maximum of +15 to Damage and +15% to Critical Attack. 

dark_cloud_header=^def_hint_t0^Cloud of Darkness
dark_cloud_hint=^def_hint_t1^A remote attack, which allows the creature to cast Curse on the enemy target and the surrounding troops.


// ÃÂÃÂÃÂÃÂÃÂÃÂ«
demon_header=^def_hint_t0^Demon
demon_hint=^def_hint_t1^Demonic creatures from the other world have Fire Resistance (+50%) and are immune to some spells. When combat takes place on volcanic terrain, their Defense is increased by 50%, but on frozen terrain, their Defense is decreased by 50%. Demons generate twice as much rage when attacking or defending, whether they be friend or foe.

return_header=^def_hint_t0^Strike and Return
return_hint=^def_hint_t1^Allows this creature to return to its starting position after attacking, before the enemy has an opportunity to retaliate.

domination_header=^def_hint_t0^Domination
domination_hint=^def_hint_t1^Inflicts an additional 50% damage to creatures of level 1-3.

three_head_header=^def_hint_t0^Three-headed
three_head_hint=^def_hint_t1^Allows the creature to attack three targets at once.

teleportation_header=^def_hint_t0^Teleportation
teleportation_hint=^def_hint_t1^Allows the creature to move by teleporting, ignoring any obstacles.

clear_header=^def_hint_t0^Restoration
clear_hint=^def_hint_t1^Allows the creature to remove all negative effects from itself at the beginning of its turn.

// New! Archdemon Odium
archdemon_attack_header=^def_hint_t0^Odium
archdemon_attack_hint=^def_hint_t1^The Archdemon's intense hatred and contempt towards units below its own level causes it to cast a random Spell (Dispel, Fear, Helplessness, or Magic Shackles) on the target (if applicable) when attacking units of level 1-4. The power of the spell is affected by the hero's spell power if the troop is lead by one and the spell is cast at third level.

// ÃÂÃÂÃÂÃÂ¢ÃÂ ÃÂÃÂÃÂ«
northerner_header=^def_hint_t0^Resistant to Cold
northerner_hint=^def_hint_t1^Allows the creature to take less damage from Ice spells. The creature cannot be frozen. When combat takes place on frozen terrain, the creature's Defense is increased by 50%.

berserk_header=^def_hint_t0^Berserk
berserk_hint=^def_hint_t1^The creature is always out of control. Immune to Mind spells.

gold_digger_header=^def_hint_t0^Gold Hunter
gold_digger_hint=^def_hint_t1^Allows the creature to find 10% more gold.

sea_header=^def_hint_t0^Marine
sea_hint=^def_hint_t1^During naval battles, +2 Morale.

plant_header=^def_hint_t0^Plant
plant_hint=^def_hint_t1^Plants have no Intellect or living flesh, and they have the following features:<br>Vulnerable to Fire (175% to 200% Damage)<br>Immune to Poison (20% Damage)<br>Immune to Mind spells and some other spells.<br>

eyeless_header=^def_hint_t0^Eyeless
eyeless_hint=^def_hint_t1^Immune to "Blind", "Precision" and "Shroud" spells. Can sense invisible creatures.

tasty_soil_header=^def_hint_t0^Tasty Soil
tasty_soil_hint=^def_hint_t1^Thorns receive +25% Health in Tasty Soil (Forest) environments.

night_sight_header=^def_hint_t0^Night Sight
night_sight_hint=^def_hint_t1^During nighttime and underground combat, Attack is increased by 50%.

furiousness_header=^def_hint_t0^Frenzy
furiousness_hint=^def_hint_t1^The creature has a 20% chance to infect the enemy with "Frenzy" during an attack.

critical_damage_header=^def_hint_t0^Critical Attack
critical_damage_hint=^def_hint_t1^Chance to make a Critical Attack is very high.

// New! Bear Maul that causes stunning / bleeding
bear_attack_header=^def_hint_t0^Maul
bear_attack_hint=^def_hint_t1^The bear attacks with such ferocity that it has a chance to stun and / or cause bleeding in the target. The base chance for either effect is 15% with a 10% increase / decrease based on the target's level compared to that of the bear's. For example, a level 3 bear attacking a level 2 target has a 25% chance (15% + (3-2)*10%) to cause stunning and then another 25% chance to cause bleeding in the target. Note that the chance of either effect is lessoned by the target's Physical Resistance. Targets are stunned for 2 rounds and bleed for 1 round if each attack is successful. Golems and Plants cannot be stunned and Golems, Plants, and <label=inf_undead_race_heads> cannot bleed.

spiteful_header=^def_hint_t0^Brutality
spiteful_hint=^def_hint_t1^When the bear takes damage, his Attack doubles until the end of the turn.

drowsiness_header=^def_hint_t0^Hibernation
drowsiness_hint=^def_hint_t1^The creature can fall asleep from inactivity. It wakes up when it is attacked. While sleeping, the creature can recover its health.

soars_header=^def_hint_t0^Soaring
soars_hint=^def_hint_t1^Allows the creature to fly over low obstacles and road irregularities.

weakness_header=^def_hint_t0^Weakness
weakness_hint=^def_hint_t1^When attacking, the creature has a 30% chance to cast "Weakness" on the enemy troop. The spell makes the target weak for only one turn.

poisonous_header=^def_hint_t0^Poisoning
poisonous_hint=^def_hint_t1^The creature has a 30% chance to cast "Poisoning" for 3 turns when attacking.

slow_header=^def_hint_t0^Slow
slow_hint=^def_hint_t1^The creature has a 30% chance to cast "Slow" for 1 turn when attacking.

no_retaliation_header=^def_hint_t0^No retaliation
no_retaliation_hint=^def_hint_t1^Enemy has no chance to retaliate.

underground_header=^def_hint_t0^Underground
underground_hint=^def_hint_t1^If combat takes place under ground, +50% Attack.

stone_skin_header=^def_hint_t0^Stone Skin
stone_skin_hint=^def_hint_t1^Gives the creature +20% Physical Damage Resistance.

uncursed_header=^def_hint_t0^Cursed
uncursed_hint=^def_hint_t1^When attacking, the creature has a 50% chance to curse the enemy.

poison_immunity_header=^def_hint_t0^Immune to Poison
poison_immunity_hint=^def_hint_t1^The creature has +80% Resistance to Poison Damage, and cannot be poisoned.

poison_defense_header=^def_hint_t0^Poison Protection
poison_defense_hint=^def_hint_t1^Gives the creature +50% Poison Damage Resistance.

paralyse_header=^def_hint_t0^Paralyzing Ray
paralyse_hint=^def_hint_t1^Does a Ranged Attack and has a chance to lull the enemy to sleep for 1 turn. The lower the level of the enemy, the higher the chance to lull the target.

stone_header=^def_hint_t0^Stone
stone_hint=^def_hint_t1^Stone creature, animated by magic. It is slow, but is Resistant to Fire and Physical Damage (50% Damage), Immune to Poison (20% damage) and suffers only 20% of physically resisted damage from arrows. In addition, is Immune to Mind Spells, and to spells of healing and resurrection.

// New! Cyclops Bash
bash_header=^def_hint_t0^Bash
bash_hint=^def_hint_t1^The Cyclops attacks adjacent enemies with such force that they have a chance of being stunned for 2 rounds. Stun chance is 80% for level 1 units and -20% for each level greater than 1 (0% chance for level 5).

// New! Cyclops Stone Thrower
stone_thrower_header=^def_hint_t0^Throws Stones
stone_thrower_hint=^def_hint_t1^The Cyclops throws stones which do 200% damage to obstacles, barriers, and gremlin towers. For normal targets the stones have a 50% chance of stunning the target for 3 rounds and if the stunning is successful a 25% chance of knocking the target unconscious for 2 rounds. If the target is already stunned then the chance to knock the target unconscious is +10%. Plants and Golems cannot be stunned and, including the Undead and Mind Immune creatures, cannot be knocked unconscious. The target's physical resistance affects the chance of either effect as well as the duration.

flies_header=^def_hint_t0^Flight
flies_hint=^def_hint_t1^Can fly over low obstacles or rough terrain.

hates_giants_header=^def_hint_t0^Hates Giants
hates_giants_hint=^def_hint_t1^Causes the creature to inflict double damage to Giants. If Giants are in the army, then Morale is decreased.

mind_immunity_header=^def_hint_t0^Immune to Mind spells
mind_immunity_hint=^def_hint_t1^The creature is immune to mind spells and effects.

fire_breath_header=^def_hint_t0^Firestorm
fire_breath_hint=^def_hint_t1^Allows the creature to attack three targets with Fire at once, with a high chance of burning them.

fire_immunity_header=^def_hint_t0^Immune to Fire
fire_immunity_hint=^def_hint_t1^The creature has an +80% Resistance to Fire Damage, and cannot be burned.

magic_immunity_header=^def_hint_t0^Magic Immunity
magic_immunity_hint=^def_hint_t1^Gives the creature +80% Resistance to Magic Damage. No spells effect the creature.

rebirth_header=^def_hint_t0^Rebirth
rebirth_hint=^def_hint_t1^If killed, the creature can rise from the ashes in three turns. Cannot be resurrected by magic.

dragon_breath_header=^def_hint_t0^Dragon Breath
dragon_breath_hint=^def_hint_t1^The creature strikes the target and a troop behind it with its flaming breath.

// New! Blue Dragons Features!
dragon2_breath_header=^def_hint_t0^Blue Dragon Breath
dragon2_breath_hint=^def_hint_t1^The creature strikes the target and a troop behind it with its lightning-fire breath. There is a chance to both burn and shock the targets.

discharge_header=^def_hint_t0^Lightning Burst
discharge_hint=^def_hint_t1^When being struck, the creature has a 25% chance of discharging its Lightning attack.

dragonfly_leader_header=^def_hint_t0^Dragonfly Commander
dragonfly_leader_hint=^def_hint_t1^All Dragonflies in the army gain +1 Morale.

aversion_header=^def_hint_t0^Dragon Aversion
aversion_hint=^def_hint_t1^Other dragons dislike the presence of this dragon in their army, reducing their morale.

dragon_power_header=^def_hint_t0^Dragon Power
dragon_power_hint=^def_hint_t1^Presence of such a powerful opponent as the Black Dragon fills enemies of level 1 to 4 with fear, reducing their Initiative (-2 for level 1-2 and -1 for level 3-4).

fire_protection_header=^def_hint_t0^Fire Protection
fire_protection_hint=^def_hint_t1^Gives the creature 50% Protection to Fire Damage.

fear_header=^def_hint_t0^Terrible
fear_hint=^def_hint_t1^When attacking, the creature tries to frighten the opponent. Terrified enemies cannot retaliate.

carrion_header=^def_hint_t0^Scavenger
carrion_hint=^def_hint_t1^Can reach a killed troop, which is otherwise beyond reach, receiving 2 additional Action Points.

shot_header=^def_hint_t0^Archer
shot_hint=^def_hint_t1^Ranged Attack is the basic attack for this creature. 

mage_header=^def_hint_t0^Lightning
mage_hint=^def_hint_t1^Hits the target with lightning at any distance. Inflicts Magic Damage and has a chance of shocking the target.

// New Regenerates Mana
regenerates_mana_header=^def_hint_t0^Regenerates Mana
regenerates_mana_hint=^def_hint_t1^The target has a chance to convert a small amount of damage received into Mana for its hero. The chance of conversion is based on the level of the Mage and their total Leadership.

voidability_header=^def_hint_t0^Vulnerable to Fire
voidability_hint=^def_hint_t1^Suffers double damage from Fire.

spell1_header=^def_hint_t0^Common Spells
spell1_hint=^def_hint_t1^Casts weak attacking and weakening spells.<br>Power level:I<br>

spell2_header=^def_hint_t0^Strong Spells
spell2_hint=^def_hint_t1^Casts strong attacking and weakening spells and curses.<br>Power level:II<br>

spell3_header=^def_hint_t0^Powerful Spells
spell3_hint=^def_hint_t1^Casts powerful attacking and weakening spells. Can cast Mind and Distortion spells.<br>Power level:III<br>

ice_header=^def_hint_t0^Ice
ice_hint=^def_hint_t1^Being created from ice, the Ice Ball is immune to damage from Physical and Poison Attacks (20% damage), cannot bleed, be stunned, shocked, or poisoned, and takes increased damage from Fire (150% damage), but cannot be burned.

orb_header=^def_hint_t0^Ball
orb_hint=^def_hint_t1^The creature moves only along a straight line and stops when it collides with any obstacle. The damage, inflicted by the ball, increases by [roll]% for every cell it traverses.

knockback_header=^def_hint_t0^Knockback
knockback_hint=^def_hint_t1^Knocks the target back 1 cell if possible.

ram_header=^def_hint_t0^Sheep
ram_hint=^def_hint_t1^After being turned into Sheep, creatures are able to do nothing except 'baa' and wander about.

tolerance_header=^def_hint_t0^Tolerance
tolerance_hint=^def_hint_t1^The creature can tolerate the presence of undead in the army without a penalty to Morale.

// New Morale headers / hints
dungeon_liker_header=^def_hint_t0^Likes Dungeons
dungeon_liker_hint=^def_hint_t1^Likes dungeons: +25% Attack in dungeons.

forest_liker_header=^def_hint_t0^Likes the Forest
forest_liker_hint=^def_hint_t1^Likes the forest: +25% Attack in forests.

forest_lover_header=^def_hint_t0^Loves the Forest
forest_lover_hint=^def_hint_t1^Loves the forest: +50% Attack in forests.

dungeon_disliker_header=^def_hint_t0^Dislikes Dungeons
dungeon_disliker_hint=^def_hint_t1^Dislikes dungeons: -1 Morale.

sea_sick_header=^def_hint_t0^Sea Sick
sea_sick_hint=^def_hint_t1^Gets sick at sea: -2 Morale.